run/unitCubeSpalartAllmaras/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          16;
        startFace       144;
    }
    outlet
    {
        type            patch;
        nFaces          16;
        startFace       160;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          48;
        startFace       176;
    }
    optPatch
    {
        type            patch;
        nFaces          16;
        startFace       224;
    }
)

// ************************************************************************* //
