run/unitCubeSpalartAllmaras/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes          
{
    default             steadyState;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
//     default                             Gauss linear;
    default                             none; 
    div(phi,U)                          bounded Gauss linearUpwindV grad(U);
    div(phi,nuTilda)                    bounded Gauss linear;
    div(phi,adjnuTilda)                 bounded Gauss linear;
    div((interpolate(U)&S),nuTilda)     bounded Gauss linear;
    div(((snGrad(nuTilda)*magSf)|sigma),adjnuTilda) bounded Gauss linear;
//     div((nuEff*dev2(T(grad(U)))))                       Gauss linear;
//     div(((nu+nut)*dev2(T(grad(U)))))                    Gauss linear;
}

wallDist
{
    method          meshWave;
}

/*interpolationSchemes
{
    default         linear;
}*/

// snGradSchemes
// {
//     default         corrected;
// }

// ************************************************************************* //
