run/unitCubeSpalartAllmaras/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-25; 
        relTol           0.0; 
    }

    U
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-21;
        relTol           0.0;
    }

    nuTilda
    {
        solver           BICCG;
        preconditioner   DILU;
        tolerance        1e-21;
        relTol           0.0;
    }
    
    adjnuTilda
    {
        solver           BICCG;
        preconditioner   DILU;
        tolerance        1e-21;
        relTol           0.0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-8;
        U               1e-8;
	nuTilda         1e-8;  
    }
}

relaxationFactors
{
    equations
    {
        p               0.5;
	nuTilda		0.7;
        U               0.7;
    }
}

// ************************************************************************* //
